# SheetNumberEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SheetFailures..::..SheetNumberEmpty Property
BuiltInFailures..::..SheetFailures Class See Also
---
Sheet Number is empty
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SheetNumberEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetNumberEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SheetNumberEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SheetFailures Class
Autodesk.Revit.DB Namespace